/* =====================================================================
   ЭКЗАМЕН 1 · Задача 2 (10 баллов)
   ---------------------------------------------------------------------
   Найди города, из которых выполняется БОЛЬШЕ 500 рейсов.

   Выведи: город, страну, число рейсов вылета.
   Самые загруженные — сверху.
   ===================================================================== */

select a.airport_name, a.country, COUNT(r.*) as cnt_flight
from airports a
         join timetable r on a.airport_code = r.departure_airport
GROUP BY a.airport_name, a.country
HAVING COUNT(r.*) > 500
ORDER BY COUNT(*) DESC

